nxp-mcuxpresso/mcuxsdk-examples/_boards/twrmc56f8200/demo_apps/mc_pmsm/pmsm_snsless/pin_mux.h
/*
    * Copyright 2024 NXP
    *
    * SPDX-License-Identifier: BSD-3-Clause
*/

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

#define GPIO_PUR_PU_0_MASK 0x01u /*!<@brief Pull Resistor Enable Bits Mask for item 0. */
#define PUR_PU_0_DISABLED 0x00u  /*!<@brief Pull Resistor Enable Bits: Pull resistor is disabled */

/*! @name GPIOE1 (number 46), PWM_AT
  @{ */
#define PWM_PINS_PWM_AT_GPIO GPIOE          /*!<@brief GPIO device name: GPIOE */
#define PWM_PINS_PWM_AT_PIN 1U              /*!<@brief GPIOE pin index: 1 */
#define PWM_PINS_PWM_AT_PIN_MASK kGPIO_Pin1 /*!<@brief PORT pin mask */
                                            /* @} */

/*! @name GPIOE0 (number 45), PWM_AB
  @{ */
#define PWM_PINS_PWM_AB_GPIO GPIOE          /*!<@brief GPIO device name: GPIOE */
#define PWM_PINS_PWM_AB_PIN 0U              /*!<@brief GPIOE pin index: 0 */
#define PWM_PINS_PWM_AB_PIN_MASK kGPIO_Pin0 /*!<@brief PORT pin mask */
                                            /* @} */

/*! @name GPIOE3 (number 48), PWM_BT
  @{ */
#define PWM_PINS_PWM_BT_GPIO GPIOE          /*!<@brief GPIO device name: GPIOE */
#define PWM_PINS_PWM_BT_PIN 3U              /*!<@brief GPIOE pin index: 3 */
#define PWM_PINS_PWM_BT_PIN_MASK kGPIO_Pin3 /*!<@brief PORT pin mask */
                                            /* @} */

/*! @name GPIOE2 (number 47), PWM_BB
  @{ */
#define PWM_PINS_PWM_BB_GPIO GPIOE          /*!<@brief GPIO device name: GPIOE */
#define PWM_PINS_PWM_BB_PIN 2U              /*!<@brief GPIOE pin index: 2 */
#define PWM_PINS_PWM_BB_PIN_MASK kGPIO_Pin2 /*!<@brief PORT pin mask */
                                            /* @} */

/*! @name GPIOE5 (number 52), PWM_CT
  @{ */
#define PWM_PINS_PWM_CT_GPIO GPIOE          /*!<@brief GPIO device name: GPIOE */
#define PWM_PINS_PWM_CT_PIN 5U              /*!<@brief GPIOE pin index: 5 */
#define PWM_PINS_PWM_CT_PIN_MASK kGPIO_Pin5 /*!<@brief PORT pin mask */
                                            /* @} */

/*! @name GPIOE4 (number 51), PWM_CB
  @{ */
#define PWM_PINS_PWM_CB_GPIO GPIOE          /*!<@brief GPIO device name: GPIOE */
#define PWM_PINS_PWM_CB_PIN 4U              /*!<@brief GPIOE pin index: 4 */
#define PWM_PINS_PWM_CB_PIN_MASK kGPIO_Pin4 /*!<@brief PORT pin mask */
                                            /* @} */

/*! @name GPIOC7 (number 32), DRV_SS
  @{ */
#define PWM_PINS_DRV_SS_GPIO GPIOC          /*!<@brief GPIO device name: GPIOC */
#define PWM_PINS_DRV_SS_PIN 7U              /*!<@brief GPIOC pin index: 7 */
#define PWM_PINS_DRV_SS_PIN_MASK kGPIO_Pin7 /*!<@brief PORT pin mask */
                                            /* @} */

/*! @name GPIOF0 (number 36), DRV_EN
  @{ */
#define PWM_PINS_DRV_EN_GPIO GPIOF          /*!<@brief GPIO device name: GPIOF */
#define PWM_PINS_DRV_EN_PIN 0U              /*!<@brief GPIOF pin index: 0 */
#define PWM_PINS_DRV_EN_PIN_MASK kGPIO_Pin0 /*!<@brief PORT pin mask */
                                            /* @} */

/*! @name GPIOF8 (number 6), DRV_INT
  @{ */
#define PWM_PINS_DRV_INT_GPIO GPIOF          /*!<@brief GPIO device name: GPIOF */
#define PWM_PINS_DRV_INT_PIN 8U              /*!<@brief GPIOF pin index: 8 */
#define PWM_PINS_DRV_INT_PIN_MASK kGPIO_Pin8 /*!<@brief PORT pin mask */
                                             /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void PWM_Pins(void);

/*! @name GPIOB1 (number 25), I_A_adc_a
  @{ */
#define ADC_PINS_I_A_adc_a_GPIO GPIOB          /*!<@brief GPIO device name: GPIOB */
#define ADC_PINS_I_A_adc_a_PIN 1U              /*!<@brief GPIOB pin index: 1 */
#define ADC_PINS_I_A_adc_a_PIN_MASK kGPIO_Pin1 /*!<@brief PORT pin mask */
                                               /* @} */

/*! @name GPIOB2 (number 27), I_C_adc_a
  @{ */
#define ADC_PINS_I_C_adc_a_GPIO GPIOB          /*!<@brief GPIO device name: GPIOB */
#define ADC_PINS_I_C_adc_a_PIN 2U              /*!<@brief GPIOB pin index: 2 */
#define ADC_PINS_I_C_adc_a_PIN_MASK kGPIO_Pin2 /*!<@brief PORT pin mask */
                                               /* @} */

/*! @name GPIOA0 (number 13), I_A_adc_b
  @{ */
#define ADC_PINS_I_A_adc_b_GPIO GPIOA          /*!<@brief GPIO device name: GPIOA */
#define ADC_PINS_I_A_adc_b_PIN 0U              /*!<@brief GPIOA pin index: 0 */
#define ADC_PINS_I_A_adc_b_PIN_MASK kGPIO_Pin0 /*!<@brief PORT pin mask */
                                               /* @} */

/*! @name GPIOA1 (number 14), I_B_adc_b
  @{ */
#define ADC_PINS_I_B_adc_b_GPIO GPIOA          /*!<@brief GPIO device name: GPIOA */
#define ADC_PINS_I_B_adc_b_PIN 1U              /*!<@brief GPIOA pin index: 1 */
#define ADC_PINS_I_B_adc_b_PIN_MASK kGPIO_Pin1 /*!<@brief PORT pin mask */
                                               /* @} */

/*! @name GPIOB0 (number 24), V_dcb
  @{ */
#define ADC_PINS_V_dcb_GPIO GPIOB          /*!<@brief GPIO device name: GPIOB */
#define ADC_PINS_V_dcb_PIN 0U              /*!<@brief GPIOB pin index: 0 */
#define ADC_PINS_V_dcb_PIN_MASK kGPIO_Pin0 /*!<@brief PORT pin mask */
                                           /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void ADC_Pins(void);

#define GPIO_PUR_PU_4_MASK 0x10u /*!<@brief Pull Resistor Enable Bits Mask for item 4. */
#define PUR_PU_4_DISABLED 0x00u  /*!<@brief Pull Resistor Enable Bits: Pull resistor is disabled */

/*! @name GPIOF6 (number 58), SW1
  @{ */
#define MISC_PINS_SW1_GPIO GPIOF          /*!<@brief GPIO device name: GPIOF */
#define MISC_PINS_SW1_PIN 6U              /*!<@brief GPIOF pin index: 6 */
#define MISC_PINS_SW1_PIN_MASK kGPIO_Pin6 /*!<@brief PORT pin mask */
                                          /* @} */

/*! @name GPIOB4 (number 21), LED_USER
  @{ */
#define MISC_PINS_LED_USER_GPIO GPIOB          /*!<@brief GPIO device name: GPIOB */
#define MISC_PINS_LED_USER_PIN 4U              /*!<@brief GPIOB pin index: 4 */
#define MISC_PINS_LED_USER_PIN_MASK kGPIO_Pin4 /*!<@brief PORT pin mask */
                                               /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void Misc_Pins(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
